#### Terraform Format and Style 🖌`failure`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
#### Terraform Plan 📖`failure`

<details><summary>Show Plan</summary>

```terraform
Running plan in Terraform Cloud. Output will stream here. Pressing Ctrl-C
will stop streaming the logs, but will not stop the plan running remotely.

Preparing the remote plan...

To view this run in a browser, visit:
https://app.terraform.io/app/Harmeek-Training/week-16-sentinel-enforcement/runs/run-oaPQjWk91ZNtYn9T

Waiting for the plan to start...

Terraform v1.14.0
on linux_amd64
Initializing plugins and modules...
aws_s3_bucket.demo: Refreshing state... [id=week-16-sentinel-cicd-demo-dev-20251129100827]
aws_s3_bucket.logs: Refreshing state... [id=week-16-sentinel-cicd-logs-dev-20251129100827]
aws_s3_bucket_server_side_encryption_configuration.demo: Refreshing state... [id=week-16-sentinel-cicd-demo-dev-20251129100827]
aws_s3_bucket_versioning.demo: Refreshing state... [id=week-16-sentinel-cicd-demo-dev-20251129100827]
aws_s3_bucket_public_access_block.demo: Refreshing state... [id=week-16-sentinel-cicd-demo-dev-20251129100827]
aws_s3_bucket_ownership_controls.logs: Refreshing state... [id=week-16-sentinel-cicd-logs-dev-20251129100827]
aws_s3_bucket_logging.demo: Refreshing state... [id=week-16-sentinel-cicd-demo-dev-20251129100827]
aws_s3_bucket_public_access_block.logs: Refreshing state... [id=week-16-sentinel-cicd-logs-dev-20251129100827]
aws_s3_bucket_server_side_encryption_configuration.logs: Refreshing state... [id=week-16-sentinel-cicd-logs-dev-20251129100827]
aws_s3_bucket_acl.logs: Refreshing state... [id=week-16-sentinel-cicd-logs-dev-20251129100827,log-delivery-write]
aws_s3_bucket.demo: Drift detected (update)
aws_s3_bucket_server_side_encryption_configuration.logs: Drift detected (update)
aws_s3_bucket.logs: Drift detected (update)

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # aws_s3_bucket.demo must be replaced
-/+ resource "aws_s3_bucket" "demo" {
      + acceleration_status         = (known after apply)
      + acl                         = (known after apply)
      ~ arn                         = "arn:aws:s3:::week-16-sentinel-cicd-demo-dev-20251129100827" -> (known after apply)
      ~ bucket                      = "week-16-sentinel-cicd-demo-dev-20251129100827" # forces replacement -> (known after apply) # forces replacement
      ~ bucket_domain_name          = "week-16-sentinel-cicd-demo-dev-20251129100827.s3.amazonaws.com" -> (known after apply)
      + bucket_prefix               = (known after apply)
      ~ bucket_regional_domain_name = "week-16-sentinel-cicd-demo-dev-20251129100827.s3.us-east-1.amazonaws.com" -> (known after apply)
      ~ hosted_zone_id              = "Z3AQBSTGFYJSTF" -> (known after apply)
      ~ id                          = "week-16-sentinel-cicd-demo-dev-20251129100827" -> (known after apply)
      ~ object_lock_enabled         = false -> (known after apply)
      + policy                      = (known after apply)
      ~ region                      = "us-east-1" -> (known after apply)
      ~ request_payer               = "BucketOwner" -> (known after apply)
        tags                        = {
            "Date"        = "11/29/25"
            "Environment" = "dev"
            "Name"        = "week-16-sentinel-cicd-demo-bucket"
            "Owner"       = "harmeek083@gmail.com"
            "Purpose"     = "Sentinel Policy Demo"
            "Training"    = "Week-16"
        }
      + website_domain              = (known after apply)
      + website_endpoint            = (known after apply)
        # (2 unchanged attributes hidden)

      - grant {
          - id          = "57e71d3e0950ea71aaeebbb87680098e101a1d73a3af5b5de0c17143f72c03c4" -> null
          - permissions = [
              - "FULL_CONTROL",
            ] -> null
          - type        = "CanonicalUser" -> null
        }

      - logging {
          - target_bucket = "week-16-sentinel-cicd-logs-dev-20251129100827" -> null
          - target_prefix = "s3-access-logs/" -> null
        }

      - server_side_encryption_configuration {
          - rule {
              - bucket_key_enabled = true -> null

              - apply_server_side_encryption_by_default {
                  - sse_algorithm = "AES256" -> null
                }
            }
        }

      - versioning {
          - enabled    = true -> null
          - mfa_delete = false -> null
        }
    }

  # aws_s3_bucket.logs must be replaced
-/+ resource "aws_s3_bucket" "logs" {
      + acceleration_status         = (known after apply)
      + acl                         = (known after apply)
      ~ arn                         = "arn:aws:s3:::week-16-sentinel-cicd-logs-dev-20251129100827" -> (known after apply)
      ~ bucket                      = "week-16-sentinel-cicd-logs-dev-20251129100827" # forces replacement -> (known after apply) # forces replacement
      ~ bucket_domain_name          = "week-16-sentinel-cicd-logs-dev-20251129100827.s3.amazonaws.com" -> (known after apply)
      + bucket_prefix               = (known after apply)
      ~ bucket_regional_domain_name = "week-16-sentinel-cicd-logs-dev-20251129100827.s3.us-east-1.amazonaws.com" -> (known after apply)
      ~ hosted_zone_id              = "Z3AQBSTGFYJSTF" -> (known after apply)
      ~ id                          = "week-16-sentinel-cicd-logs-dev-20251129100827" -> (known after apply)
      ~ object_lock_enabled         = false -> (known after apply)
      + policy                      = (known after apply)
      ~ region                      = "us-east-1" -> (known after apply)
      ~ request_payer               = "BucketOwner" -> (known after apply)
        tags                        = {
            "Environment" = "dev"
            "Name"        = "week-16-sentinel-cicd-logs-bucket"
            "Owner"       = "harmeek083@gmail.com"
            "Purpose"     = "Access Logs Storage"
        }
      + website_domain              = (known after apply)
      + website_endpoint            = (known after apply)
        # (2 unchanged attributes hidden)

      - grant {
          - permissions = [
              - "READ_ACP",
              - "WRITE",
            ] -> null
          - type        = "Group" -> null
          - uri         = "http://acs.amazonaws.com/groups/s3/LogDelivery" -> null
        }
      - grant {
          - id          = "57e71d3e0950ea71aaeebbb87680098e101a1d73a3af5b5de0c17143f72c03c4" -> null
          - permissions = [
              - "FULL_CONTROL",
            ] -> null
          - type        = "CanonicalUser" -> null
        }

      - server_side_encryption_configuration {
          - rule {
              - bucket_key_enabled = false -> null

              - apply_server_side_encryption_by_default {
                  - sse_algorithm = "AES256" -> null
                }
            }
        }

      - versioning {
          - enabled    = false -> null
          - mfa_delete = false -> null
        }
    }

  # aws_s3_bucket_acl.logs must be replaced
-/+ resource "aws_s3_bucket_acl" "logs" {
      ~ bucket = "week-16-sentinel-cicd-logs-dev-20251129100827" # forces replacement -> (known after apply) # forces replacement
      ~ id     = "week-16-sentinel-cicd-logs-dev-20251129100827,log-delivery-write" -> (known after apply)
        # (1 unchanged attribute hidden)

      - access_control_policy {
          - grant {
              - permission = "READ_ACP" -> null

              - grantee {
                  - type = "Group" -> null
                  - uri  = "http://acs.amazonaws.com/groups/s3/LogDelivery" -> null
                }
            }
          - grant {
              - permission = "WRITE" -> null

              - grantee {
                  - type = "Group" -> null
                  - uri  = "http://acs.amazonaws.com/groups/s3/LogDelivery" -> null
                }
            }
          - grant {
              - permission = "FULL_CONTROL" -> null

              - grantee {
                  - id   = "57e71d3e0950ea71aaeebbb87680098e101a1d73a3af5b5de0c17143f72c03c4" -> null
                  - type = "CanonicalUser" -> null
                }
            }
          - owner {
              - id = "57e71d3e0950ea71aaeebbb87680098e101a1d73a3af5b5de0c17143f72c03c4" -> null
            }
        }
    }

  # aws_s3_bucket_logging.demo must be replaced
-/+ resource "aws_s3_bucket_logging" "demo" {
      ~ bucket        = "week-16-sentinel-cicd-demo-dev-20251129100827" # forces replacement -> (known after apply) # forces replacement
      ~ id            = "week-16-sentinel-cicd-demo-dev-20251129100827" -> (known after apply)
      ~ target_bucket = "week-16-sentinel-cicd-logs-dev-20251129100827" -> (known after apply)
        # (1 unchanged attribute hidden)
    }

  # aws_s3_bucket_ownership_controls.logs must be replaced
-/+ resource "aws_s3_bucket_ownership_controls" "logs" {
      ~ bucket = "week-16-sentinel-cicd-logs-dev-20251129100827" # forces replacement -> (known after apply) # forces replacement
      ~ id     = "week-16-sentinel-cicd-logs-dev-20251129100827" -> (known after apply)

        # (1 unchanged block hidden)
    }

  # aws_s3_bucket_public_access_block.demo must be replaced
-/+ resource "aws_s3_bucket_public_access_block" "demo" {
      ~ bucket                  = "week-16-sentinel-cicd-demo-dev-20251129100827" # forces replacement -> (known after apply) # forces replacement
      ~ id                      = "week-16-sentinel-cicd-demo-dev-20251129100827" -> (known after apply)
        # (4 unchanged attributes hidden)
    }

  # aws_s3_bucket_public_access_block.logs must be replaced
-/+ resource "aws_s3_bucket_public_access_block" "logs" {
      ~ bucket                  = "week-16-sentinel-cicd-logs-dev-20251129100827" # forces replacement -> (known after apply) # forces replacement
      ~ id                      = "week-16-sentinel-cicd-logs-dev-20251129100827" -> (known after apply)
        # (4 unchanged attributes hidden)
    }

  # aws_s3_bucket_server_side_encryption_configuration.demo must be replaced
-/+ resource "aws_s3_bucket_server_side_encryption_configuration" "demo" {
      ~ bucket = "week-16-sentinel-cicd-demo-dev-20251129100827" # forces replacement -> (known after apply) # forces replacement
      ~ id     = "week-16-sentinel-cicd-demo-dev-20251129100827" -> (known after apply)

        # (1 unchanged block hidden)
    }

  # aws_s3_bucket_server_side_encryption_configuration.logs must be replaced
-/+ resource "aws_s3_bucket_server_side_encryption_configuration" "logs" {
      ~ bucket = "week-16-sentinel-cicd-logs-dev-20251129100827" # forces replacement -> (known after apply) # forces replacement
      ~ id     = "week-16-sentinel-cicd-logs-dev-20251129100827" -> (known after apply)

      - rule {
          - bucket_key_enabled = false -> null

          - apply_server_side_encryption_by_default {
              - sse_algorithm = "AES256" -> null
            }
        }
      + rule {
          + apply_server_side_encryption_by_default {
              + sse_algorithm = "AES256"
            }
        }
    }

  # aws_s3_bucket_versioning.demo must be replaced
-/+ resource "aws_s3_bucket_versioning" "demo" {
      ~ bucket = "week-16-sentinel-cicd-demo-dev-20251129100827" # forces replacement -> (known after apply) # forces replacement
      ~ id     = "week-16-sentinel-cicd-demo-dev-20251129100827" -> (known after apply)

      ~ versioning_configuration {
          + mfa_delete = (known after apply)
            # (1 unchanged attribute hidden)
        }
    }

Plan: 10 to add, 0 to change, 10 to destroy.

Changes to Outputs:
  ~ logs_bucket_arn               = "arn:aws:s3:::week-16-sentinel-cicd-logs-dev-20251129100827" -> (known after apply)
  ~ logs_bucket_name              = "week-16-sentinel-cicd-logs-dev-20251129100827" -> (known after apply)
  ~ next_steps                    = <<-EOT
        ✅ Resources successfully deployed!
            
        📋 Next Steps:
        1. Verify resources in AWS Console:
           - S3 Bucket: week-16-sentinel-cicd-demo-dev-20251129100827
           - Logs Bucket: week-16-sentinel-cicd-logs-dev-20251129100827
            
        2. Test Sentinel policies:
           - Try creating non-compliant resource
           - Observe policy failure in GitHub Actions
            
        3. Review Terraform Cloud:
           - Check policy check results
           - Review run history
            
        4. Document evidence:
           - Screenshot created resources
           - Capture policy check results
           - Save workflow execution logs
    EOT -> (known after apply)
  ~ s3_bucket_arn                 = "arn:aws:s3:::week-16-sentinel-cicd-demo-dev-20251129100827" -> (known after apply)
  ~ s3_bucket_name                = "week-16-sentinel-cicd-demo-dev-20251129100827" -> (known after apply)
  ~ s3_bucket_region              = "us-east-1" -> (known after apply)

Post-plan Tasks:

OPA Policy Evaluation

→→ Overall Result: FAILED
 This result means that one or more OPA policies failed. More than likely, this was due to the discovery of violations by the main rule and other sub rules
0 policies evaluated

→ Policy set 1: week-15-cis-advanced (0)

```

</details>

**Pusher**: @Harmeek-19
**Action**: pull_request
**Working Directory**: `week-16-sentinel-cicd/terraform`
**Workflow**: `Terraform Plan`

---

### 🛡️ Sentinel Policy Checks

Policy results are available in [Terraform Cloud](Harmeek-Training/workspaces/week-16-sentinel-enforcement/runs)

- Check policies passed/failed
- Review enforcement levels
- View detailed policy output
